Требуется разработать мобильное приложение для ювелирного магазина. В прложении будет показан список изготавливаемых украшений. Изделия в приложении имеют уникальный номер и наименование. Украшения делятся на группы (кольца, браслеты и т.п). 

Каждое блюдо характеризуется следующими параметрами:
уникальный номер, наименование, используемые материалы, группа, изображение, стоимость работы и материалов

В приложении присутствуют кассир. На каждого работника вносятся следующие сведения:
уникальный номер, имя, логин, пароль

При работе с программой официант должен иметь возможность решать следующие задачи:
принимать заказы, отменять заказы
